{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "FKawaiiPhysicsModuleEd",
			"Children": [
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": "Kawaii Physics"
					},
					"Key": "FKawaiiPhysicsEditMode"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": "Kawaii Physics"
					},
					"Key": "KawaiiPhysicsMenuGroup"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysics",
			"Children": [
				{
					"Source": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Translation": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Key": "CheckPresetDiffUnknownAnimBlueprint"
				},
				{
					"Source": {
						"Text": "Applies a preset data asset to this node."
					},
					"Translation": {
						"Text": "Applies a preset data asset to this node."
					},
					"Key": "ApplyPresetMenuToolTip"
				},
				{
					"Source": {
						"Text": "Apply Preset..."
					},
					"Translation": {
						"Text": "Apply Preset..."
					},
					"Key": "ApplyPresetMenuLabel"
				},
				{
					"Source": {
						"Text": "Check Preset Diff"
					},
					"Translation": {
						"Text": "Check Preset Diff"
					},
					"Key": "CheckPresetDiffMenuLabel"
				},
				{
					"Source": {
						"Text": "Choose Kawaii Physics Preset"
					},
					"Translation": {
						"Text": "Choose Kawaii Physics Preset"
					},
					"Key": "ApplyPresetDialogTitle"
				},
				{
					"Source": {
						"Text": "DebugVisualization"
					},
					"Translation": {
						"Text": "DebugVisualization"
					},
					"Key": "ToggleDebugVisualizationButtonRow"
				},
				{
					"Source": {
						"Text": "Exported BoneConstraints Data Asset: {0}"
					},
					"Translation": {
						"Text": "Exported BoneConstraints Data Asset: {0}"
					},
					"Key": "ExportedBoneConstraintsDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Limits Data Asset: {0}"
					},
					"Translation": {
						"Text": "Exported Limits Data Asset: {0}"
					},
					"Key": "ExportedLimitsDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Preset Data Asset: {0}"
					},
					"Translation": {
						"Text": "Exported Preset Data Asset: {0}"
					},
					"Key": "ExportedPresetDataAsset"
				},
				{
					"Source": {
						"Text": "Exported Preset Data Asset: {0}\nWarning: this node has no KawaiiPhysicsTag, so TargetTags is empty. Set a tag to include it in Reapply/Audit."
					},
					"Translation": {
						"Text": "Exported Preset Data Asset: {0}\nWarning: this node has no KawaiiPhysicsTag, so TargetTags is empty. Set a tag to include it in Reapply/Audit."
					},
					"Key": "ExportedPresetDataAssetNoTag"
				},
				{
					"Source": {
						"Text": "Exported from Anim Blueprint: {0}"
					},
					"Translation": {
						"Text": "Exported from Anim Blueprint: {0}"
					},
					"Key": "ExportedPresetDataAssetDescription"
				},
				{
					"Source": {
						"Text": "Failed to apply Preset: {0}"
					},
					"Translation": {
						"Text": "Failed to apply Preset: {0}"
					},
					"Key": "ApplyPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to load selected Kawaii Physics preset."
					},
					"Translation": {
						"Text": "Failed to load selected Kawaii Physics preset."
					},
					"Key": "ApplyPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": "Kawaii Physics"
					},
					"Key": "Kawaii Physics"
				},
				{
					"Source": {
						"Text": "Kawaii Physics"
					},
					"Translation": {
						"Text": "Kawaii Physics"
					},
					"Key": "KawaiiPhysicsContextMenuSection"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsTools"
					},
					"Translation": {
						"Text": "KawaiiPhysicsTools"
					},
					"Key": "KawaiiPhysics"
				},
				{
					"Source": {
						"Text": "No Procedural Wind external force on this node."
					},
					"Translation": {
						"Text": "No Procedural Wind external force on this node."
					},
					"Key": "NoProceduralWindExternalForce"
				},
				{
					"Source": {
						"Text": "No preset targets this node's tag."
					},
					"Translation": {
						"Text": "No preset targets this node's tag."
					},
					"Key": "NoPresetTargetsNodeTag"
				},
				{
					"Source": {
						"Text": "Open Created Asset"
					},
					"Translation": {
						"Text": "Open Created Asset"
					},
					"Key": "OpenCreatedAsset"
				},
				{
					"Source": {
						"Text": "Open Preset"
					},
					"Translation": {
						"Text": "Open Preset"
					},
					"Key": "OpenAppliedPresetAsset"
				},
				{
					"Source": {
						"Text": "Open Preset"
					},
					"Translation": {
						"Text": "Open Preset"
					},
					"Key": "OpenPresetAsset"
				},
				{
					"Source": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Translation": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Key": "OpenWindScopeToolTip"
				},
				{
					"Source": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Translation": {
						"Text": "Opens the waveform preview tab for Procedural Wind."
					},
					"Key": "WindScopeMenuToolTip"
				},
				{
					"Source": {
						"Text": "Shows the diff between this node and its presets in a tab."
					},
					"Translation": {
						"Text": "Shows the diff between this node and its presets in a tab."
					},
					"Key": "CheckPresetDiffMenuToolTip"
				},
				{
					"Source": {
						"Text": "Wind Scope"
					},
					"Translation": {
						"Text": "Wind Scope"
					},
					"Key": "OpenWindScope"
				},
				{
					"Source": {
						"Text": "Wind Scope"
					},
					"Translation": {
						"Text": "Wind Scope"
					},
					"Key": "WindScopeContextMenu"
				},
				{
					"Source": {
						"Text": "Wind Scope (Force [{0}])"
					},
					"Translation": {
						"Text": "Wind Scope (Force [{0}])"
					},
					"Key": "WindScopeContextMenuWithForceIndex"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Translation": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Key": "CheckPresetDiffContextLabel"
				},
				{
					"Source": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}"
					},
					"Translation": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}"
					},
					"Key": "AnimGraphNode_KawaiiPhysics_Title"
				},
				{
					"Source": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}\nTag:  {Tag} "
					},
					"Translation": {
						"Text": "{ControllerDescription}\nRoot: {RootBoneName}\nTag:  {Tag} "
					},
					"Key": "AnimGraphNode_KawaiiPhysics_TitleWithTag"
				},
				{
					"Source": {
						"Text": "{ControllerDescription} - Root: {RootBoneName}"
					},
					"Translation": {
						"Text": "{ControllerDescription} - Root: {RootBoneName}"
					},
					"Key": "AnimGraphNode_KawaiiPhysics_ListTitle"
				},
				{
					"Source": {
						"Text": "{ControllerDescription} - Root: {RootBoneName} - Tag: {Tag}"
					},
					"Translation": {
						"Text": "{ControllerDescription} - Root: {RootBoneName} - Tag: {Tag}"
					},
					"Key": "AnimGraphNode_KawaiiPhysics_ListTitleWithTag"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsEditMode",
			"Children": [
				{
					"Source": {
						"Text": "Delete KawaiiPhysics Collision"
					},
					"Translation": {
						"Text": "Delete KawaiiPhysics Collision"
					},
					"Key": "DeleteKawaiiCollision"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsEditorLibrary",
			"Children": [
				{
					"Source": {
						"Text": "Add Kawaii Physics Nodes"
					},
					"Translation": {
						"Text": "Add Kawaii Physics Nodes"
					},
					"Key": "AddKawaiiPhysicsNodes"
				},
				{
					"Source": {
						"Text": "Apply Kawaii Physics Preset"
					},
					"Translation": {
						"Text": "Apply Kawaii Physics Preset"
					},
					"Key": "ApplyPresetToGraphNode"
				},
				{
					"Source": {
						"Text": "Applying Kawaii Physics preset to AnimBlueprints..."
					},
					"Translation": {
						"Text": "Applying Kawaii Physics preset to AnimBlueprints..."
					},
					"Key": "ReapplyPresetToProjectProgress"
				},
				{
					"Source": {
						"Text": "Export Kawaii Physics Graph Node To Preset"
					},
					"Translation": {
						"Text": "Export Kawaii Physics Graph Node To Preset"
					},
					"Key": "ExportGraphNodeToPreset"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Property"
					},
					"Translation": {
						"Text": "Set Kawaii Physics Graph Node Property"
					},
					"Key": "SetGraphNodePropertyByString"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Root Bone"
					},
					"Translation": {
						"Text": "Set Kawaii Physics Graph Node Root Bone"
					},
					"Key": "SetGraphNodeRootBoneName"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Tag"
					},
					"Translation": {
						"Text": "Set Kawaii Physics Graph Node Tag"
					},
					"Key": "SetGraphNodeTag"
				},
				{
					"Source": {
						"Text": "Set Kawaii Physics Graph Node Wildcard Property"
					},
					"Translation": {
						"Text": "Set Kawaii Physics Graph Node Wildcard Property"
					},
					"Key": "SetGraphNodeWildcardProperty"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsNodeAuditWindow",
			"Children": [
				{
					"Source": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Translation": {
						"Text": "(Unknown AnimBlueprint)"
					},
					"Key": "ViewDiffUnknownAnimBlueprint"
				},
				{
					"Source": {
						"Text": "Anim Blueprint のアセット名を表示します。ツールチップにフルパスを表示します / Shows the Anim Blueprint asset name. The tooltip shows the full path."
					},
					"Translation": {
						"Text": "Anim Blueprint のアセット名を表示します。ツールチップにフルパスを表示します / Shows the Anim Blueprint asset name. The tooltip shows the full path."
					},
					"Key": "AnimBlueprintColumnToolTip"
				},
				{
					"Source": {
						"Text": "AnimBlueprint"
					},
					"Translation": {
						"Text": "AnimBlueprint"
					},
					"Key": "AnimBlueprintColumnLabel"
				},
				{
					"Source": {
						"Text": "Applied preset to {0} node(s)."
					},
					"Translation": {
						"Text": "Applied preset to {0} node(s)."
					},
					"Key": "ApplyToProjectSucceeded"
				},
				{
					"Source": {
						"Text": "Apply preset '{0}' to the project?\n{1} node(s) currently differ from this preset."
					},
					"Translation": {
						"Text": "Apply preset '{0}' to the project?\n{1} node(s) currently differ from this preset."
					},
					"Key": "ApplyToProjectConfirm"
				},
				{
					"Source": {
						"Text": "Apply to Project 実行時にソース管理でパッケージをチェックアウトします / Checks out packages via source control when running Apply to Project."
					},
					"Translation": {
						"Text": "Apply to Project 実行時にソース管理でパッケージをチェックアウトします / Checks out packages via source control when running Apply to Project."
					},
					"Key": "CheckOutFilesToolTip"
				},
				{
					"Source": {
						"Text": "Apply to Project..."
					},
					"Translation": {
						"Text": "Apply to Project..."
					},
					"Key": "ApplyToProjectButton"
				},
				{
					"Source": {
						"Text": "Check out files"
					},
					"Translation": {
						"Text": "Check out files"
					},
					"Key": "CheckOutFilesLabel"
				},
				{
					"Source": {
						"Text": "DiffProperties"
					},
					"Translation": {
						"Text": "DiffProperties"
					},
					"Key": "DiffPropertiesColumnLabel"
				},
				{
					"Source": {
						"Text": "Export Kawaii Physics Audit"
					},
					"Translation": {
						"Text": "Export Kawaii Physics Audit"
					},
					"Key": "ExportDialogTitle"
				},
				{
					"Source": {
						"Text": "Export..."
					},
					"Translation": {
						"Text": "Export..."
					},
					"Key": "ExportButton"
				},
				{
					"Source": {
						"Text": "Exported Kawaii Physics audit results."
					},
					"Translation": {
						"Text": "Exported Kawaii Physics audit results."
					},
					"Key": "ExportSucceeded"
				},
				{
					"Source": {
						"Text": "Failed to export the Kawaii Physics audit results."
					},
					"Translation": {
						"Text": "Failed to export the Kawaii Physics audit results."
					},
					"Key": "ExportFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the matched preset."
					},
					"Translation": {
						"Text": "Failed to load the matched preset."
					},
					"Key": "ViewDiffPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the preset for Apply to Project."
					},
					"Translation": {
						"Text": "Failed to load the preset for Apply to Project."
					},
					"Key": "ApplyToProjectPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the preset for Refresh."
					},
					"Translation": {
						"Text": "Failed to load the preset for Refresh."
					},
					"Key": "RefreshPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Translation": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Key": "OpenAnimBlueprintFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "ViewDiffResolveFailed"
				},
				{
					"Source": {
						"Text": "Graph"
					},
					"Translation": {
						"Text": "Graph"
					},
					"Key": "GraphColumnLabel"
				},
				{
					"Source": {
						"Text": "Kawaii Node Audit"
					},
					"Translation": {
						"Text": "Kawaii Node Audit"
					},
					"Key": "NodeAuditTabLabel"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Node Audit"
					},
					"Translation": {
						"Text": "Kawaii Physics: Node Audit"
					},
					"Key": "NodeAuditMenuDisplayName"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics のノード監査タブを開きます / Opens the KawaiiPhysics node audit tab."
					},
					"Translation": {
						"Text": "KawaiiPhysics のノード監査タブを開きます / Opens the KawaiiPhysics node audit tab."
					},
					"Key": "NodeAuditMenuTooltip"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsTag を表示します / Shows the KawaiiPhysicsTag."
					},
					"Translation": {
						"Text": "KawaiiPhysicsTag を表示します / Shows the KawaiiPhysicsTag."
					},
					"Key": "TagColumnToolTip"
				},
				{
					"Source": {
						"Text": "Matches"
					},
					"Translation": {
						"Text": "Matches"
					},
					"Key": "MatchesColumnLabel"
				},
				{
					"Source": {
						"Text": "Refresh"
					},
					"Translation": {
						"Text": "Refresh"
					},
					"Key": "RefreshButton"
				},
				{
					"Source": {
						"Text": "RootBone"
					},
					"Translation": {
						"Text": "RootBone"
					},
					"Key": "RootBoneColumnLabel"
				},
				{
					"Source": {
						"Text": "RootBone のボーン名を表示します / Shows the RootBone bone name."
					},
					"Translation": {
						"Text": "RootBone のボーン名を表示します / Shows the RootBone bone name."
					},
					"Key": "RootBoneColumnToolTip"
				},
				{
					"Source": {
						"Text": "Show Differing Only"
					},
					"Translation": {
						"Text": "Show Differing Only"
					},
					"Key": "ShowDifferingOnlyLabel"
				},
				{
					"Source": {
						"Text": "Show in Folder"
					},
					"Translation": {
						"Text": "Show in Folder"
					},
					"Key": "ExportSucceededHyperlink"
				},
				{
					"Source": {
						"Text": "Tag"
					},
					"Translation": {
						"Text": "Tag"
					},
					"Key": "TagColumnLabel"
				},
				{
					"Source": {
						"Text": "View Diff"
					},
					"Translation": {
						"Text": "View Diff"
					},
					"Key": "ViewDiffButton"
				},
				{
					"Source": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Translation": {
						"Text": "{0}  |  {1}  |  Tag: {2}"
					},
					"Key": "ViewDiffContextLabel"
				},
				{
					"Source": {
						"Text": "{0} nodes, {1} differ"
					},
					"Translation": {
						"Text": "{0} nodes, {1} differ"
					},
					"Key": "AuditSummaryFormat"
				},
				{
					"Source": {
						"Text": "✓"
					},
					"Translation": {
						"Text": "✓"
					},
					"Key": "MatchesCheckMark"
				},
				{
					"Source": {
						"Text": "このノードとマッチしたプリセットの差分を表示します / Shows the diff between this node and its matched preset."
					},
					"Translation": {
						"Text": "このノードとマッチしたプリセットの差分を表示します / Shows the diff between this node and its matched preset."
					},
					"Key": "ViewDiffButtonToolTip"
				},
				{
					"Source": {
						"Text": "このプリセットを、対象タグに一致するプロジェクト内の全ノードへ適用します / Applies this preset to every node in the project that matches its target tags."
					},
					"Translation": {
						"Text": "このプリセットを、対象タグに一致するプロジェクト内の全ノードへ適用します / Applies this preset to every node in the project that matches its target tags."
					},
					"Key": "ApplyToProjectButtonToolTip"
				},
				{
					"Source": {
						"Text": "ノードとマッチしたプリセットの差分をウィンドウで表示します / Shows the diff between the node and its matched preset in a window."
					},
					"Translation": {
						"Text": "ノードとマッチしたプリセットの差分をウィンドウで表示します / Shows the diff between the node and its matched preset in a window."
					},
					"Key": "ViewDiffColumnToolTip"
				},
				{
					"Source": {
						"Text": "ノードを含むグラフ名を表示します / Shows the name of the graph that owns the node."
					},
					"Translation": {
						"Text": "ノードを含むグラフ名を表示します / Shows the name of the graph that owns the node."
					},
					"Key": "GraphColumnToolTip"
				},
				{
					"Source": {
						"Text": "プリセットと一致していない行だけを表示します（表示のみのフィルタ） / Shows only rows that do not match the preset (display filter only)."
					},
					"Translation": {
						"Text": "プリセットと一致していない行だけを表示します（表示のみのフィルタ） / Shows only rows that do not match the preset (display filter only)."
					},
					"Key": "ShowDifferingOnlyToolTip"
				},
				{
					"Source": {
						"Text": "プリセットと一致していればチェック、そうでなければ差分プロパティ数を表示します / Shows a check mark when the node matches the preset, otherwise the number of differing properties."
					},
					"Translation": {
						"Text": "プリセットと一致していればチェック、そうでなければ差分プロパティ数を表示します / Shows a check mark when the node matches the preset, otherwise the number of differing properties."
					},
					"Key": "MatchesColumnToolTip"
				},
				{
					"Source": {
						"Text": "プリセットを対象ノードへドライラン適用し直し、一覧を再計算します / Re-runs a dry-run apply of the preset against the target nodes and rebuilds the list."
					},
					"Translation": {
						"Text": "プリセットを対象ノードへドライラン適用し直し、一覧を再計算します / Re-runs a dry-run apply of the preset against the target nodes and rebuilds the list."
					},
					"Key": "RefreshButtonToolTip"
				},
				{
					"Source": {
						"Text": "差分のあるプロパティ名をカンマ区切りで表示します / Shows differing property names, comma-separated."
					},
					"Translation": {
						"Text": "差分のあるプロパティ名をカンマ区切りで表示します / Shows differing property names, comma-separated."
					},
					"Key": "DiffPropertiesColumnToolTip"
				},
				{
					"Source": {
						"Text": "監査結果なし: プリセット DataAsset 詳細の [Find Target Nodes] / [Apply To Project (Dry Run)] から開いてください / No audit results: open from the preset DataAsset details."
					},
					"Translation": {
						"Text": "監査結果なし: プリセット DataAsset 詳細の [Find Target Nodes] / [Apply To Project (Dry Run)] から開いてください / No audit results: open from the preset DataAsset details."
					},
					"Key": "NoAuditResultsGuidance"
				},
				{
					"Source": {
						"Text": "監査結果を JSON または CSV ファイルへ書き出します / Exports the audit results to a JSON or CSV file."
					},
					"Translation": {
						"Text": "監査結果を JSON または CSV ファイルへ書き出します / Exports the audit results to a JSON or CSV file."
					},
					"Key": "ExportButtonToolTip"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsPresetDataAssetDetails",
			"Children": [
				{
					"Source": {
						"Text": "Apply To Project (Dry Run): {0}"
					},
					"Translation": {
						"Text": "Apply To Project (Dry Run): {0}"
					},
					"Key": "ApplyToProjectDryRunWindowTitle"
				},
				{
					"Source": {
						"Text": "Dry run: {0} nodes matched, {1} differ from preset."
					},
					"Translation": {
						"Text": "Dry run: {0} nodes matched, {1} differ from preset."
					},
					"Key": "ApplyToProjectDryRunResult"
				},
				{
					"Source": {
						"Text": "Find Target Nodes: {0}"
					},
					"Translation": {
						"Text": "Find Target Nodes: {0}"
					},
					"Key": "FindTargetNodesWindowTitle"
				},
				{
					"Source": {
						"Text": "KawaiiPhysicsPresetTargetTools"
					},
					"Translation": {
						"Text": "KawaiiPhysicsPresetTargetTools"
					},
					"Key": "KawaiiPhysicsPresetTargetTools"
				},
				{
					"Source": {
						"Text": "Searching AnimBlueprints for KawaiiPhysics nodes..."
					},
					"Translation": {
						"Text": "Searching AnimBlueprints for KawaiiPhysics nodes..."
					},
					"Key": "FindTargetNodesProgress"
				},
				{
					"Source": {
						"Text": "TargetTags is empty - no nodes will be targeted."
					},
					"Translation": {
						"Text": "TargetTags is empty - no nodes will be targeted."
					},
					"Key": "TargetTagsEmpty"
				},
				{
					"Source": {
						"Text": "TargetTags に一致する KawaiiPhysics ノードをプロジェクト内の全 AnimBlueprint から検索し、結果をタブで一覧表示します（詳細は Output Log にも出力） / Searches all AnimBlueprints in the project for KawaiiPhysics nodes matching TargetTags and lists the results in a tab (details are also logged to the Output Log)."
					},
					"Translation": {
						"Text": "TargetTags に一致する KawaiiPhysics ノードをプロジェクト内の全 AnimBlueprint から検索し、結果をタブで一覧表示します（詳細は Output Log にも出力） / Searches all AnimBlueprints in the project for KawaiiPhysics nodes matching TargetTags and lists the results in a tab (details are also logged to the Output Log)."
					},
					"Key": "FindTargetNodesToolTip"
				},
				{
					"Source": {
						"Text": "{0} nodes in {1} AnimBlueprints match TargetTags."
					},
					"Translation": {
						"Text": "{0} nodes in {1} AnimBlueprints match TargetTags."
					},
					"Key": "FindTargetNodesResult"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsPresetDiffWindow",
			"Children": [
				{
					"Source": {
						"Text": "Applied selected properties to the node."
					},
					"Translation": {
						"Text": "Applied selected properties to the node."
					},
					"Key": "ApplySelectedSucceeded"
				},
				{
					"Source": {
						"Text": "Applied the preset to the node."
					},
					"Translation": {
						"Text": "Applied the preset to the node."
					},
					"Key": "ApplyPresetSucceeded"
				},
				{
					"Source": {
						"Text": "Apply Preset to Node"
					},
					"Translation": {
						"Text": "Apply Preset to Node"
					},
					"Key": "ApplyPresetToNodeButton"
				},
				{
					"Source": {
						"Text": "Apply Selected"
					},
					"Translation": {
						"Text": "Apply Selected"
					},
					"Key": "ApplySelectedButton"
				},
				{
					"Source": {
						"Text": "Apply Selected Kawaii Physics Preset Properties"
					},
					"Translation": {
						"Text": "Apply Selected Kawaii Physics Preset Properties"
					},
					"Key": "ApplySelectedTransaction"
				},
				{
					"Source": {
						"Text": "Category"
					},
					"Translation": {
						"Text": "Category"
					},
					"Key": "CategoryColumnLabel"
				},
				{
					"Source": {
						"Text": "Copied preset diff to clipboard."
					},
					"Translation": {
						"Text": "Copied preset diff to clipboard."
					},
					"Key": "CopySucceeded"
				},
				{
					"Source": {
						"Text": "Failed to apply the preset to the node."
					},
					"Translation": {
						"Text": "Failed to apply the preset to the node."
					},
					"Key": "ApplyPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to copy one or more properties to the preset."
					},
					"Translation": {
						"Text": "Failed to copy one or more properties to the preset."
					},
					"Key": "UpdatePresetCopyFailed"
				},
				{
					"Source": {
						"Text": "Failed to copy one or more selected properties."
					},
					"Translation": {
						"Text": "Failed to copy one or more selected properties."
					},
					"Key": "ApplySelectedCopyFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": "Failed to load the selected preset."
					},
					"Key": "ApplyPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": "Failed to load the selected preset."
					},
					"Key": "ApplySelectedPresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": "Failed to load the selected preset."
					},
					"Key": "OpenPresetFailed"
				},
				{
					"Source": {
						"Text": "Failed to load the selected preset."
					},
					"Translation": {
						"Text": "Failed to load the selected preset."
					},
					"Key": "UpdatePresetLoadFailed"
				},
				{
					"Source": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Translation": {
						"Text": "Failed to open the AnimBlueprint."
					},
					"Key": "OpenAnimBlueprintFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "ApplyPresetResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "ApplySelectedResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "UpdatePresetResolveFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics node."
					},
					"Key": "RefreshResolveFailed"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Preset Diff"
					},
					"Translation": {
						"Text": "Kawaii Physics: Preset Diff"
					},
					"Key": "PresetDiffMenuDisplayName"
				},
				{
					"Source": {
						"Text": "Kawaii Preset Diff"
					},
					"Translation": {
						"Text": "Kawaii Preset Diff"
					},
					"Key": "PresetDiffTabLabel"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics のプリセット差分タブを開きます / Opens the KawaiiPhysics preset diff tab."
					},
					"Translation": {
						"Text": "KawaiiPhysics のプリセット差分タブを開きます / Opens the KawaiiPhysics preset diff tab."
					},
					"Key": "PresetDiffMenuTooltip"
				},
				{
					"Source": {
						"Text": "Matches preset"
					},
					"Translation": {
						"Text": "Matches preset"
					},
					"Key": "MatchesPresetSummary"
				},
				{
					"Source": {
						"Text": "No Preset"
					},
					"Translation": {
						"Text": "No Preset"
					},
					"Key": "NoPresetSelected"
				},
				{
					"Source": {
						"Text": "No differing properties to update."
					},
					"Translation": {
						"Text": "No differing properties to update."
					},
					"Key": "NoPresetPropertiesToUpdate"
				},
				{
					"Source": {
						"Text": "No preset selected"
					},
					"Translation": {
						"Text": "No preset selected"
					},
					"Key": "NoSnapshotSummary"
				},
				{
					"Source": {
						"Text": "Node Value"
					},
					"Translation": {
						"Text": "Node Value"
					},
					"Key": "NodeValueColumnLabel"
				},
				{
					"Source": {
						"Text": "Preset Value"
					},
					"Translation": {
						"Text": "Preset Value"
					},
					"Key": "PresetValueColumnLabel"
				},
				{
					"Source": {
						"Text": "Property"
					},
					"Translation": {
						"Text": "Property"
					},
					"Key": "PropertyColumnLabel"
				},
				{
					"Source": {
						"Text": "Show All Properties"
					},
					"Translation": {
						"Text": "Show All Properties"
					},
					"Key": "ShowAllPropertiesLabel"
				},
				{
					"Source": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Translation": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Key": "ApplyPresetChanged"
				},
				{
					"Source": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Translation": {
						"Text": "The preset or node changed. Review the refreshed diff before applying."
					},
					"Key": "ApplySelectedPresetChanged"
				},
				{
					"Source": {
						"Text": "Update Kawaii Physics Preset From Node"
					},
					"Translation": {
						"Text": "Update Kawaii Physics Preset From Node"
					},
					"Key": "UpdatePresetTransaction"
				},
				{
					"Source": {
						"Text": "Update Preset from Node"
					},
					"Translation": {
						"Text": "Update Preset from Node"
					},
					"Key": "UpdatePresetFromNodeButton"
				},
				{
					"Source": {
						"Text": "Update preset '{0}' from the node and overwrite {1} properties?"
					},
					"Translation": {
						"Text": "Update preset '{0}' from the node and overwrite {1} properties?"
					},
					"Key": "UpdatePresetConfirm"
				},
				{
					"Source": {
						"Text": "Updated the preset from the node."
					},
					"Translation": {
						"Text": "Updated the preset from the node."
					},
					"Key": "UpdatePresetSucceeded"
				},
				{
					"Source": {
						"Text": "{0} properties differ"
					},
					"Translation": {
						"Text": "{0} properties differ"
					},
					"Key": "DiffCountSummary"
				},
				{
					"Source": {
						"Text": "このプロパティを Apply Selected / Update Preset from Node の対象にします / Selects this property for Apply Selected or Update Preset from Node."
					},
					"Translation": {
						"Text": "このプロパティを Apply Selected / Update Preset from Node の対象にします / Selects this property for Apply Selected or Update Preset from Node."
					},
					"Key": "RowSelectionToolTip"
				},
				{
					"Source": {
						"Text": "カテゴリ、表示名、内部プロパティ名で絞り込みます / Filters by category, display name, or internal property name."
					},
					"Translation": {
						"Text": "カテゴリ、表示名、内部プロパティ名で絞り込みます / Filters by category, display name, or internal property name."
					},
					"Key": "SearchToolTip"
				},
				{
					"Source": {
						"Text": "チェックしたプロパティだけをプリセットからノードへ適用します / Applies only checked properties from the preset to the node."
					},
					"Translation": {
						"Text": "チェックしたプロパティだけをプリセットからノードへ適用します / Applies only checked properties from the preset to the node."
					},
					"Key": "ApplySelectedButtonToolTip"
				},
				{
					"Source": {
						"Text": "チェックした差分、または未チェック時は全差分をノードからプリセットへ反映します / Updates checked diffs, or all diffs when none are checked, from the node to the preset."
					},
					"Translation": {
						"Text": "チェックした差分、または未チェック時は全差分をノードからプリセットへ反映します / Updates checked diffs, or all diffs when none are checked, from the node to the preset."
					},
					"Key": "UpdatePresetFromNodeButtonToolTip"
				},
				{
					"Source": {
						"Text": "ノードを再解決して差分を再計算します / Re-resolves the node and rebuilds the diffs."
					},
					"Translation": {
						"Text": "ノードを再解決して差分を再計算します / Re-resolves the node and rebuilds the diffs."
					},
					"Key": "RefreshButtonToolTip"
				},
				{
					"Source": {
						"Text": "プリセット側の値を表示します / Shows the value stored in the preset."
					},
					"Translation": {
						"Text": "プリセット側の値を表示します / Shows the value stored in the preset."
					},
					"Key": "PresetValueColumnToolTip"
				},
				{
					"Source": {
						"Text": "プロパティを操作対象として選択します / Selects a property for operations."
					},
					"Translation": {
						"Text": "プロパティを操作対象として選択します / Selects a property for operations."
					},
					"Key": "SelectionColumnToolTip"
				},
				{
					"Source": {
						"Text": "プロパティカテゴリを表示します / Shows the property category."
					},
					"Translation": {
						"Text": "プロパティカテゴリを表示します / Shows the property category."
					},
					"Key": "CategoryColumnToolTip"
				},
				{
					"Source": {
						"Text": "一致しているプロパティも表示します / Shows properties that already match too."
					},
					"Translation": {
						"Text": "一致しているプロパティも表示します / Shows properties that already match too."
					},
					"Key": "ShowAllPropertiesToolTip"
				},
				{
					"Source": {
						"Text": "差分をタブ区切りテキストとしてクリップボードへコピーします / Copies the diff as tab-separated text to the clipboard."
					},
					"Translation": {
						"Text": "差分をタブ区切りテキストとしてクリップボードへコピーします / Copies the diff as tab-separated text to the clipboard."
					},
					"Key": "CopyButtonToolTip"
				},
				{
					"Source": {
						"Text": "差分未選択: KawaiiPhysics ノードの [Check Preset Diff] から開いてください / No diff selected: open from a KawaiiPhysics node's [Check Preset Diff]."
					},
					"Translation": {
						"Text": "差分未選択: KawaiiPhysics ノードの [Check Preset Diff] から開いてください / No diff selected: open from a KawaiiPhysics node's [Check Preset Diff]."
					},
					"Key": "NoDiffSelectedGuidance"
				},
				{
					"Source": {
						"Text": "現在のノード側の値を表示します / Shows the current value on the node."
					},
					"Translation": {
						"Text": "現在のノード側の値を表示します / Shows the current value on the node."
					},
					"Key": "NodeValueColumnToolTip"
				},
				{
					"Source": {
						"Text": "表示するプリセット差分を選択します / Selects the preset diff to display."
					},
					"Translation": {
						"Text": "表示するプリセット差分を選択します / Selects the preset diff to display."
					},
					"Key": "PresetComboToolTip"
				},
				{
					"Source": {
						"Text": "表示名を表示し、ツールチップで内部名を表示します / Shows the display name, with the internal name in the tooltip."
					},
					"Translation": {
						"Text": "表示名を表示し、ツールチップで内部名を表示します / Shows the display name, with the internal name in the tooltip."
					},
					"Key": "PropertyColumnToolTip"
				},
				{
					"Source": {
						"Text": "選択中のプリセットアセットを開きます / Opens the selected preset asset."
					},
					"Translation": {
						"Text": "選択中のプリセットアセットを開きます / Opens the selected preset asset."
					},
					"Key": "OpenPresetButtonToolTip"
				},
				{
					"Source": {
						"Text": "選択中のプリセット全体をノードへ適用します / Applies the whole selected preset to the node."
					},
					"Translation": {
						"Text": "選択中のプリセット全体をノードへ適用します / Applies the whole selected preset to the node."
					},
					"Key": "ApplyPresetToNodeButtonToolTip"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindPresetDataAsset",
			"Children": [
				{
					"Source": {
						"Text": "Breeze"
					},
					"Translation": {
						"Text": "Breeze"
					},
					"Key": "BreezePresetName"
				},
				{
					"Source": {
						"Text": "Storm"
					},
					"Translation": {
						"Text": "Storm"
					},
					"Key": "StormPresetName"
				},
				{
					"Source": {
						"Text": "Strong"
					},
					"Translation": {
						"Text": "Strong"
					},
					"Key": "StrongPresetName"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindScopeEditPanel",
			"Children": [
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": " + Sample."
					},
					"Key": "FormulaPlusGust"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": " + Sample."
					},
					"Key": "FormulaPlusOscillation"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": " + Sample."
					},
					"Key": "FormulaPlusRandom"
				},
				{
					"Source": {
						"Text": " + Sample."
					},
					"Translation": {
						"Text": " + Sample."
					},
					"Key": "FormulaPlusWave"
				},
				{
					"Source": {
						"Text": " = ("
					},
					"Translation": {
						"Text": " = ("
					},
					"Key": "FormulaEquals"
				},
				{
					"Source": {
						"Text": "({0}, {1}, {2})"
					},
					"Translation": {
						"Text": "({0}, {1}, {2})"
					},
					"Key": "LiveVectorValueFormat"
				},
				{
					"Source": {
						"Text": ") * Sample."
					},
					"Translation": {
						"Text": ") * Sample."
					},
					"Key": "FormulaEnvelopePrefix"
				},
				{
					"Source": {
						"Text": ";"
					},
					"Translation": {
						"Text": ";"
					},
					"Key": "FormulaSemicolon"
				},
				{
					"Source": {
						"Text": "?"
					},
					"Translation": {
						"Text": "?"
					},
					"Key": "FormulaHelpButton"
				},
				{
					"Source": {
						"Text": "Common"
					},
					"Translation": {
						"Text": "Common"
					},
					"Key": "CommonGroupLabel"
				},
				{
					"Source": {
						"Text": "Composition formula help."
					},
					"Translation": {
						"Text": "Composition formula help."
					},
					"Key": "FormulaHelpTooltip"
				},
				{
					"Source": {
						"Text": "Direction"
					},
					"Translation": {
						"Text": "Direction"
					},
					"Key": "DirectionGroupLabel"
				},
				{
					"Source": {
						"Text": "Edit the curve in the Details panel"
					},
					"Translation": {
						"Text": "Edit the curve in the Details panel"
					},
					"Key": "CurveEditGuide"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": "Envelope"
					},
					"Key": "EnvelopeGroupLabel"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": "Envelope"
					},
					"Key": "FormulaEnvelope"
				},
				{
					"Source": {
						"Text": "Focus Node"
					},
					"Translation": {
						"Text": "Focus Node"
					},
					"Key": "FocusNodeButton"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": "Gust"
					},
					"Key": "FormulaGust"
				},
				{
					"Source": {
						"Text": "Gust maps to the Gust button and S/R/D inputs above."
					},
					"Translation": {
						"Text": "Gust maps to the Gust button and S/R/D inputs above."
					},
					"Key": "FormulaHelpGroupLine2"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": "Oscillation"
					},
					"Key": "FormulaOscillation"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": "Oscillation"
					},
					"Key": "OscillationGroupLabel"
				},
				{
					"Source": {
						"Text": "Pin-driven values take precedence over panel edits."
					},
					"Translation": {
						"Text": "Pin-driven values take precedence over panel edits."
					},
					"Key": "PinDrivenWarningTooltip"
				},
				{
					"Source": {
						"Text": "Procedural Wind"
					},
					"Translation": {
						"Text": "Procedural Wind"
					},
					"Key": "EditPanelHeader"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": "Random"
					},
					"Key": "FormulaRandom"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": "Random"
					},
					"Key": "RandomGroupLabel"
				},
				{
					"Source": {
						"Text": "Reset to default."
					},
					"Translation": {
						"Text": "Reset to default."
					},
					"Key": "ResetToDefaultTooltip"
				},
				{
					"Source": {
						"Text": "Sample."
					},
					"Translation": {
						"Text": "Sample."
					},
					"Key": "FormulaSteadyPrefix"
				},
				{
					"Source": {
						"Text": "Sample."
					},
					"Translation": {
						"Text": "Sample."
					},
					"Key": "FormulaTotalPrefix"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": "Steady"
					},
					"Key": "FormulaSteady"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": "Steady"
					},
					"Key": "SteadyGroupLabel"
				},
				{
					"Source": {
						"Text": "Steady, Oscillation, Wave, Envelope, and Random map to their groups."
					},
					"Translation": {
						"Text": "Steady, Oscillation, Wave, Envelope, and Random map to their groups."
					},
					"Key": "FormulaHelpGroupLine1"
				},
				{
					"Source": {
						"Text": "Time"
					},
					"Translation": {
						"Text": "Time"
					},
					"Key": "TimeGroupLabel"
				},
				{
					"Source": {
						"Text": "Total"
					},
					"Translation": {
						"Text": "Total"
					},
					"Key": "FormulaTotal"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": "Wave"
					},
					"Key": "FormulaWave"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": "Wave"
					},
					"Key": "WaveGroupLabel"
				},
				{
					"Source": {
						"Text": "false"
					},
					"Translation": {
						"Text": "false"
					},
					"Key": "LiveBoolFalse"
				},
				{
					"Source": {
						"Text": "true"
					},
					"Translation": {
						"Text": "true"
					},
					"Key": "LiveBoolTrue"
				},
				{
					"Source": {
						"Text": "→ {0} (live)"
					},
					"Translation": {
						"Text": "→ {0} (live)"
					},
					"Key": "LiveValueFormat"
				}
			]
		},
		{
			"Namespace": "KawaiiPhysicsWindScopeWindow",
			"Children": [
				{
					"Source": {
						"Text": "#{0} ProceduralWind"
					},
					"Translation": {
						"Text": "#{0} ProceduralWind"
					},
					"Key": "ExternalForceItemFormat"
				},
				{
					"Source": {
						"Text": "#{0} ProceduralWind"
					},
					"Translation": {
						"Text": "#{0} ProceduralWind"
					},
					"Key": "SelectedExternalForceFormat"
				},
				{
					"Source": {
						"Text": "Add New Preset"
					},
					"Translation": {
						"Text": "Add New Preset"
					},
					"Key": "SavePresetAddNewMenu"
				},
				{
					"Source": {
						"Text": "Add current parameters as a new preset."
					},
					"Translation": {
						"Text": "Add current parameters as a new preset."
					},
					"Key": "SavePresetAddNewTooltip"
				},
				{
					"Source": {
						"Text": "Applied {0} wind preset. (live)"
					},
					"Translation": {
						"Text": "Applied {0} wind preset. (live)"
					},
					"Key": "ApplyPresetSucceededLive"
				},
				{
					"Source": {
						"Text": "Applied {0} wind preset. (node only — no live target)"
					},
					"Translation": {
						"Text": "Applied {0} wind preset. (node only — no live target)"
					},
					"Key": "ApplyPresetSucceededNodeOnly"
				},
				{
					"Source": {
						"Text": "Apply Kawaii Physics Wind Preset"
					},
					"Translation": {
						"Text": "Apply Kawaii Physics Wind Preset"
					},
					"Key": "ApplyWindPresetTransaction"
				},
				{
					"Source": {
						"Text": "Clipboard does not contain ProceduralWind parameters."
					},
					"Translation": {
						"Text": "Clipboard does not contain ProceduralWind parameters."
					},
					"Key": "PasteWindParametersInvalidClipboard"
				},
				{
					"Source": {
						"Text": "Copied ProceduralWind parameters to clipboard."
					},
					"Translation": {
						"Text": "Copied ProceduralWind parameters to clipboard."
					},
					"Key": "CopyWindParametersSucceeded"
				},
				{
					"Source": {
						"Text": "Copy current ProceduralWind parameters."
					},
					"Translation": {
						"Text": "Copy current ProceduralWind parameters."
					},
					"Key": "CopyWindParametersTooltip"
				},
				{
					"Source": {
						"Text": "Custom {0}"
					},
					"Translation": {
						"Text": "Custom {0}"
					},
					"Key": "SavePresetCustomNameFormat"
				},
				{
					"Source": {
						"Text": "D"
					},
					"Translation": {
						"Text": "D"
					},
					"Key": "GustDecayShortLabel"
				},
				{
					"Source": {
						"Text": "Edit Kawaii Physics Wind Parameter"
					},
					"Translation": {
						"Text": "Edit Kawaii Physics Wind Parameter"
					},
					"Key": "EditWindParameterTransaction"
				},
				{
					"Source": {
						"Text": "Envelope"
					},
					"Translation": {
						"Text": "Envelope"
					},
					"Key": "EnvelopeLabel"
				},
				{
					"Source": {
						"Text": "Failed to load the Wind Scope Preset Data Asset."
					},
					"Translation": {
						"Text": "Failed to load the Wind Scope Preset Data Asset."
					},
					"Key": "SavePresetLoadDataAssetFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "ApplyPresetNoNode"
				},
				{
					"Source": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Translation": {
						"Text": "Failed to resolve the KawaiiPhysics graph node."
					},
					"Key": "FocusWindScopeNodeFailed"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Translation": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Key": "EditWindParamPropertyMissing"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Translation": {
						"Text": "Failed to resolve the wind parameter property."
					},
					"Key": "ResetWindParamPropertyMissing"
				},
				{
					"Source": {
						"Text": "Failed to resolve the wind preset to overwrite."
					},
					"Translation": {
						"Text": "Failed to resolve the wind preset to overwrite."
					},
					"Key": "SavePresetInvalidOverwriteTarget"
				},
				{
					"Source": {
						"Text": "Failed to update the wind parameter."
					},
					"Translation": {
						"Text": "Failed to update the wind parameter."
					},
					"Key": "EditWindParamSetFailed"
				},
				{
					"Source": {
						"Text": "Force"
					},
					"Translation": {
						"Text": "Force"
					},
					"Key": "ExternalForceLabel"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": "Gust"
					},
					"Key": "GustButton"
				},
				{
					"Source": {
						"Text": "Gust"
					},
					"Translation": {
						"Text": "Gust"
					},
					"Key": "GustLabel"
				},
				{
					"Source": {
						"Text": "Gust decay time."
					},
					"Translation": {
						"Text": "Gust decay time."
					},
					"Key": "GustDecaySpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust decay time."
					},
					"Translation": {
						"Text": "Gust decay time."
					},
					"Key": "GustDecayTooltip"
				},
				{
					"Source": {
						"Text": "Gust rise time."
					},
					"Translation": {
						"Text": "Gust rise time."
					},
					"Key": "GustRiseSpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust rise time."
					},
					"Translation": {
						"Text": "Gust rise time."
					},
					"Key": "GustRiseTooltip"
				},
				{
					"Source": {
						"Text": "Gust strength."
					},
					"Translation": {
						"Text": "Gust strength."
					},
					"Key": "GustStrengthSpinTooltip"
				},
				{
					"Source": {
						"Text": "Gust strength."
					},
					"Translation": {
						"Text": "Gust strength."
					},
					"Key": "GustStrengthTooltip"
				},
				{
					"Source": {
						"Text": "Kawaii Physics: Wind Scope"
					},
					"Translation": {
						"Text": "Kawaii Physics: Wind Scope"
					},
					"Key": "WindScopeMenuDisplayName"
				},
				{
					"Source": {
						"Text": "Kawaii Wind Scope"
					},
					"Translation": {
						"Text": "Kawaii Wind Scope"
					},
					"Key": "WindScopeTabLabel"
				},
				{
					"Source": {
						"Text": "KawaiiPhysics Node"
					},
					"Translation": {
						"Text": "KawaiiPhysics Node"
					},
					"Key": "UnknownTargetNode"
				},
				{
					"Source": {
						"Text": "Live"
					},
					"Translation": {
						"Text": "Live"
					},
					"Key": "LiveModeTick"
				},
				{
					"Source": {
						"Text": "No ProceduralWind"
					},
					"Translation": {
						"Text": "No ProceduralWind"
					},
					"Key": "NoExternalForceSelected"
				},
				{
					"Source": {
						"Text": "No ProceduralWind external force was found."
					},
					"Translation": {
						"Text": "No ProceduralWind external force was found."
					},
					"Key": "ApplyPresetNoWind"
				},
				{
					"Source": {
						"Text": "No node selected: open from [Wind Scope] on a KawaiiPhysics node."
					},
					"Translation": {
						"Text": "No node selected: open from [Wind Scope] on a KawaiiPhysics node."
					},
					"Key": "NoTargetNodeGuidance"
				},
				{
					"Source": {
						"Text": "None"
					},
					"Translation": {
						"Text": "None"
					},
					"Key": "NoExternalForceItem"
				},
				{
					"Source": {
						"Text": "Open Project Settings"
					},
					"Translation": {
						"Text": "Open Project Settings"
					},
					"Key": "OpenProjectSettingsMenu"
				},
				{
					"Source": {
						"Text": "Open Project Settings > Plugins > Kawaii Physics."
					},
					"Translation": {
						"Text": "Open Project Settings > Plugins > Kawaii Physics."
					},
					"Key": "OpenProjectSettingsTooltip"
				},
				{
					"Source": {
						"Text": "Opens the KawaiiPhysics wind preview tab."
					},
					"Translation": {
						"Text": "Opens the KawaiiPhysics wind preview tab."
					},
					"Key": "WindScopeMenuTooltip"
				},
				{
					"Source": {
						"Text": "Oscillation"
					},
					"Translation": {
						"Text": "Oscillation"
					},
					"Key": "OscillationLabel"
				},
				{
					"Source": {
						"Text": "Overwrite this preset with current parameters."
					},
					"Translation": {
						"Text": "Overwrite this preset with current parameters."
					},
					"Key": "SavePresetOverwriteTooltip"
				},
				{
					"Source": {
						"Text": "Overwrite:"
					},
					"Translation": {
						"Text": "Overwrite:"
					},
					"Key": "SavePresetOverwriteSection"
				},
				{
					"Source": {
						"Text": "Overwrote {0} wind preset."
					},
					"Translation": {
						"Text": "Overwrote {0} wind preset."
					},
					"Key": "SavePresetSucceededOverwrite"
				},
				{
					"Source": {
						"Text": "Paste Kawaii Physics Wind Parameters"
					},
					"Translation": {
						"Text": "Paste Kawaii Physics Wind Parameters"
					},
					"Key": "PasteWindParametersTransaction"
				},
				{
					"Source": {
						"Text": "Paste ProceduralWind parameters from the clipboard."
					},
					"Translation": {
						"Text": "Paste ProceduralWind parameters from the clipboard."
					},
					"Key": "PasteWindParametersTooltip"
				},
				{
					"Source": {
						"Text": "Pasted ProceduralWind parameters. (live)"
					},
					"Translation": {
						"Text": "Pasted ProceduralWind parameters. (live)"
					},
					"Key": "PasteWindParametersSucceededLive"
				},
				{
					"Source": {
						"Text": "Pasted ProceduralWind parameters. (node only — no live target)"
					},
					"Translation": {
						"Text": "Pasted ProceduralWind parameters. (node only — no live target)"
					},
					"Key": "PasteWindParametersSucceededNodeOnly"
				},
				{
					"Source": {
						"Text": "Pause"
					},
					"Translation": {
						"Text": "Pause"
					},
					"Key": "PauseLabel"
				},
				{
					"Source": {
						"Text": "Preset list has changed. Reload first."
					},
					"Translation": {
						"Text": "Preset list has changed. Reload first."
					},
					"Key": "SavePresetListChanged"
				},
				{
					"Source": {
						"Text": "Preset {0}"
					},
					"Translation": {
						"Text": "Preset {0}"
					},
					"Key": "WindPresetFallbackNameFormat"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "Preview"
					},
					"Key": "InitialMode"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "Preview"
					},
					"Key": "PreviewMode"
				},
				{
					"Source": {
						"Text": "Preview"
					},
					"Translation": {
						"Text": "Preview"
					},
					"Key": "PreviewModeTick"
				},
				{
					"Source": {
						"Text": "R"
					},
					"Translation": {
						"Text": "R"
					},
					"Key": "GustRiseShortLabel"
				},
				{
					"Source": {
						"Text": "Random"
					},
					"Translation": {
						"Text": "Random"
					},
					"Key": "RandomLabel"
				},
				{
					"Source": {
						"Text": "Reload"
					},
					"Translation": {
						"Text": "Reload"
					},
					"Key": "ReloadPresetsButton"
				},
				{
					"Source": {
						"Text": "Reload the preset DataAsset."
					},
					"Translation": {
						"Text": "Reload the preset DataAsset."
					},
					"Key": "ReloadPresetsTooltip"
				},
				{
					"Source": {
						"Text": "S"
					},
					"Translation": {
						"Text": "S"
					},
					"Key": "GustStrengthShortLabel"
				},
				{
					"Source": {
						"Text": "Save Kawaii Physics Wind Preset"
					},
					"Translation": {
						"Text": "Save Kawaii Physics Wind Preset"
					},
					"Key": "SaveWindPresetTransaction"
				},
				{
					"Source": {
						"Text": "Save as Preset"
					},
					"Translation": {
						"Text": "Save as Preset"
					},
					"Key": "SavePresetButton"
				},
				{
					"Source": {
						"Text": "Save current parameters to the preset DataAsset."
					},
					"Translation": {
						"Text": "Save current parameters to the preset DataAsset."
					},
					"Key": "SavePresetTooltip"
				},
				{
					"Source": {
						"Text": "Saved {0} wind preset."
					},
					"Translation": {
						"Text": "Saved {0} wind preset."
					},
					"Key": "SavePresetSucceededAdd"
				},
				{
					"Source": {
						"Text": "Seconds"
					},
					"Translation": {
						"Text": "Seconds"
					},
					"Key": "DisplaySecondsLabel"
				},
				{
					"Source": {
						"Text": "Sends a test gust to the live target."
					},
					"Translation": {
						"Text": "Sends a test gust to the live target."
					},
					"Key": "GustButtonTooltip"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings first."
					},
					"Translation": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings first."
					},
					"Key": "SavePresetNoDataAsset"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Translation": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Key": "SavePresetNoDataAssetMenuInfo"
				},
				{
					"Source": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Translation": {
						"Text": "Set the Wind Scope Preset Data Asset in Project Settings to save presets."
					},
					"Key": "SavePresetNoDataAssetTooltip"
				},
				{
					"Source": {
						"Text": "Skipped wind gust. (no live target)"
					},
					"Translation": {
						"Text": "Skipped wind gust. (no live target)"
					},
					"Key": "GustNoLiveTarget"
				},
				{
					"Source": {
						"Text": "Steady"
					},
					"Translation": {
						"Text": "Steady"
					},
					"Key": "SteadyLabel"
				},
				{
					"Source": {
						"Text": "The selected external force is not ProceduralWind."
					},
					"Translation": {
						"Text": "The selected external force is not ProceduralWind."
					},
					"Key": "ApplyPresetInvalidWind"
				},
				{
					"Source": {
						"Text": "Toggle the parameter edit panel."
					},
					"Translation": {
						"Text": "Toggle the parameter edit panel."
					},
					"Key": "ToggleEditPanelTooltip"
				},
				{
					"Source": {
						"Text": "Total"
					},
					"Translation": {
						"Text": "Total"
					},
					"Key": "TotalLabel"
				},
				{
					"Source": {
						"Text": "Total {0}  Steady {1}  Osc {2}  Wave {3}  Env {4}  Rand {5}  Gust {6}"
					},
					"Translation": {
						"Text": "Total {0}  Steady {1}  Osc {2}  Wave {3}  Env {4}  Rand {5}  Gust {6}"
					},
					"Key": "CurrentValuesFormat"
				},
				{
					"Source": {
						"Text": "Triggered wind gust. (live)"
					},
					"Translation": {
						"Text": "Triggered wind gust. (live)"
					},
					"Key": "GustSucceededLive"
				},
				{
					"Source": {
						"Text": "Wave"
					},
					"Translation": {
						"Text": "Wave"
					},
					"Key": "WaveLabel"
				}
			]
		}
	]
}